InformationRegisters/ТекущиеСостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСостоянияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ra_Nesootvetstvie</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_AktObUstraneniiNesootvetstviya</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_ItogovyjOtchetONesootvetstvii</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_PreduprezhdayushcheeDejstvie</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_OtchetONesootvetstviiCHast1</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_OtchetONesootvetstviiCHast3</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_OtchetONesootvetstviiCHast2</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящиеДокументы</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_OperaciyaOcenkiSootvetstviya</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_OcenkaZnachimosti</v8:Type>
						<v8:Type>cfg:CatalogRef.ВнутренниеДокументы</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_PlanProvedeniyaOcenkiSootvetstviya</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_ZayavkaNaOcenkuSootvetstviya</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеДокументы</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_KorrektiruyushcheeDejstvie</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_ZayavkaNaKontrolnuyuOperaciyu</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_Uvedomlenie</v8:Type>
						<v8:Type>cfg:DocumentRef.ra_VremennyeSderzhivayushchieDejstviyaIKorrekciya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассмотрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Проект</Name>
					<Comment>Используется для бизнес-процесса "Согласование"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_НаРассмотрении</Name>
					<Comment>Используется для бизнес-процесса "Согласование"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Принято</Name>
					<Comment>Используется для бизнес-процесса "Согласование"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_НаПодтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_НаУтверждении</Name>
					<Comment>Используется для бизнес-процесса "Согласование"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Утвержден</Name>
					<Comment>Используется для бизнес-процесса "Согласование"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_НеУтвержден</Name>
					<Comment>Используется для бизнес-процесса "Согласование"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_НаУстранении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Устранено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ra_Аннулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ra_Uvedomlenie.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ra_Uvedomlenie</Name>
			<BasedOn>
				<xr:Item>Document.ra_Nesootvetstvie</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ра_ОборотыПоказателейОтчета</xr:Item>
				<xr:Item>InformationRegister.ra_OcenkiZnachimostiNesootvetstvij</xr:Item>
				<xr:Item>AccumulationRegister.del_ра_ОборотыПоказателейОтчета</xr:Item>
				<xr:Item>InformationRegister.ra_VyyavivshayaIDopustivshayaOrganizacii</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DataVyyavleniya</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataVyzova</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>del_DopustivsheePodrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>del_OtvetstvennyjZaKachestvoVnutrennij</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>del_PoStoronnejOrganizacii</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Dogovor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_Dogovory</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KlassifikatorMTRiO</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_KlassifikatorMTR</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NachaloPerioda</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Nesootvetstvie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ra_Nesootvetstvie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ObemRabot</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_ObemyRabot</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrganizaciyaOtpravitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OrganizaciyaPoluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtvetstvennyjZaKachestvoOtpravitel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OtvetstvennyjZaKachestvoPoluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PeriodOcenkiPovtoryaemosti</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Povtoryaemost</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrichinaAnnulirovaniya</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidNesootvetstviya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ra_VidyNesootvetstvij</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VidOperacii</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ra_VidyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VyzvatPredstavitelya</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВнутреннихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UchityvatKlassifikatorMTRiO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Soglasuyushchie</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Organizaciya</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Polzovatel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Podrazdelenie</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Dolzhnost</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>PovtornyeNesootvetstviya</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Nesootvetstvie</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ra_Nesootvetstvie</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Povtornoe</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ТекущиеСостоянияДокументов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") Тогда
		ЗарегистрироватьСогласуемыеДокументы("ОбменБухгалтерияПредприятияДокументооборот20");
		ЗарегистрироватьСогласуемыеДокументы("ОбменУправлениеХолдингомДокументооборот20");
	КонецЕсли;
	
	// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 02.10.2018 {
	УстановитьПривилегированныйРежим(Истина);
	ЗарегистрироватьСогласуемыеДокументы("ра_ОбменДаннымиСЕОСЗакупки");
	// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 02.10.2018 } 
	
КонецПроцедуры

// Регистрирует документы при изменении состояния согласования
//
// Параметры:
//  ИмяПланаОбмена - Строка - имя плана обмена, для узлов которого следует выполнить регистрацию
//
Процедура ЗарегистрироватьСогласуемыеДокументы(ИмяПланаОбмена)
	
	УзлыПланаОбмена = ОбменДаннымиПовтИсп.УзлыПланаОбмена(ИмяПланаОбмена);
	Если УзлыПланаОбмена.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СоставПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав;
	
	// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 03.10.2018 {
	// для обмена с ЕОС-Закупки в плане обмена добавлено 2 узла:
	// 1 - Узел, соответствующий контуру ЕОС-Закупки, находящемуся в ЦОД
	// 2 - Узел, соответствующий контуру ЕОС-Закупки, находящемуся в СБИС МБ
	// Для ЕОС-ЗАкупки регистрируем следующие изменения:
	// - Если Уведомление о несоответствии имеет статус "Принято"
	// - Если Отчет ч2 или Итоговый отчет имеет статус "Утвержден" 
	// Если Договор по НС международный, то регистрируем изменения в 2 узла, иначе только в ЦОД
	ТипДокументаУведомлениеДляОбменаСЕОСЗакупки = Новый ОписаниеТипов("ДокументСсылка.ra_Uvedomlenie"); 
	ПрочиеТипыДокументовДляОбменаСЕОСЗакупки    = Новый ОписаниеТипов("ДокументСсылка.ra_OtchetONesootvetstviiCHast2, ДокументСсылка.ra_ItogovyjOtchetONesootvetstvii");
	ДополнительныеДанныеДляРегистрации = ПолучитьДополнительныеДанныеДляРегистрацииОбъектовВПланеОбменаДляЕОСЗакупки(ЭтотОбъект.ВыгрузитьКолонку("Документ")); 
	Если ИмяПланаОбмена = "ра_ОбменДаннымиСЕОСЗакупки" Тогда 
		УзлыПланаОбменаСЕОСЗакупки = ра_ОбщегоНазначенияПовтИсп.УзлыПланаОбменаДляЕОСЗакупки();
		УзелЕОСЗакупкиВЦОД    = Неопределено;
		УзелЕОСЗакупкиВСБИСМБ = Неопределено;
		Для Каждого Узел из УзлыПланаОбменаСЕОСЗакупки Цикл 
			Если Узел.МеждународныйКонтур Тогда 
				УзелЕОСЗакупкиВСБИСМБ = Узел.ОбычныйУзел;	
			Иначе 
				УзелЕОСЗакупкиВЦОД = Узел.ОбычныйУзел;
			КонецЕсли;	
		КонецЦикла;
		
		Если УзелЕОСЗакупкиВСБИСМБ = Неопределено
			или УзелЕОСЗакупкиВЦОД = Неопределено Тогда 
			ВызватьИсключение НСтр("ru = 'Необходимо добавить узлы в плане обмена ""Обмен данными с ЕОС-Закупки"". Обратитесь к администратору системы'; en = 'You need to add nodes to the exchange settings with SAP SRM. You must contact the system administrator'");
		КонецЕсли;	
		
	КонецЕсли;	
		
	// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 03.10.2018 } 
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 03.10.2018 {
		Если ИмяПланаОбмена = "ра_ОбменДаннымиСЕОСЗакупки" Тогда 
			
			УсловиеНаСтатусВыполнено = Ложь;
			Если (ТипДокументаУведомлениеДляОбменаСЕОСЗакупки.СодержитТип(ТипЗнч(Запись.Документ))
				И Запись.Состояние = Перечисления.СостоянияДокументов.ra_Принято)
				Или (ПрочиеТипыДокументовДляОбменаСЕОСЗакупки.СодержитТип(ТипЗнч(Запись.Документ))
				И Запись.Состояние = Перечисления.СостоянияДокументов.ra_Утвержден) Тогда 
				УсловиеНаСтатусВыполнено = Истина;
			КонецЕсли;
			
			Если Не УсловиеНаСтатусВыполнено Тогда 
				Продолжить;
			КонецЕсли;	
			
			// получим список узлов плана обмена для регистрации изменений
			МассивУзлов = Новый Массив;
			МассивУзлов.Добавить(УзелЕОСЗакупкиВЦОД); // в ЕОС-Закупки в ЦОД всегда выгружаем
			РегистрируемоеНесоответствие = Неопределено;
			СтрокиСДополнительнымиДанными = ДополнительныеДанныеДляРегистрации.НайтиСтроки(Новый Структура("Документ", Запись.Документ));
			Для Каждого СтрокаДополнительныхДанных Из СтрокиСДополнительнымиДанными Цикл 
				Если СтрокаДополнительныхДанных.ТребуетсяВыгрузкаВМеждународныйКонтур Тогда 
					МассивУзлов.Добавить(УзелЕОСЗакупкиВСБИСМБ);
				КонецЕсли;	
				РегистрируемоеНесоответствие = СтрокаДополнительныхДанных.ДокументНС;
			КонецЦикла;	
			
			Если РегистрируемоеНесоответствие = Неопределено Тогда 
				Продолжить;
			КонецЕсли;	
			
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов, РегистрируемоеНесоответствие);
		// Корнюшенков А.Ю. Искать в тексте "ОбменНесоответствиямиСЕОСЗакупки" 03.10.2018 }
		
		ИначеЕсли (Запись.Состояние = Перечисления.СостоянияДокументов.НаСогласовании
			или Запись.Состояние = Перечисления.СостоянияДокументов.Согласован
			или Запись.Состояние = Перечисления.СостоянияДокументов.НеСогласован) 
			и СоставПланаОбмена.Содержит(Запись.Документ.Метаданные()) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзлыПланаОбмена, Запись.Документ);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьДополнительныеДанныеДляРегистрацииОбъектовВПланеОбменаДляЕОСЗакупки(СписокДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка КАК Документ,
		|	ВложенныйЗапрос.ТребуетсяВыгрузкаВМеждународныйКонтур КАК ТребуетсяВыгрузкаВМеждународныйКонтур,
		|	ВложенныйЗапрос.ДокументНС КАК ДокументНС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ra_Uvedomlenie.Ссылка КАК Ссылка,
		|		ВЫБОР
		|			КОГДА ПОДСТРОКА(ra_Uvedomlenie.Dogovor.ID_SRM, 1, 1) = ""8""
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК ТребуетсяВыгрузкаВМеждународныйКонтур,
		|		ra_Uvedomlenie.Nesootvetstvie КАК ДокументНС
		|	ИЗ
		|		Документ.ra_Uvedomlenie КАК ra_Uvedomlenie
		|	ГДЕ
		|		ra_Uvedomlenie.Ссылка В(&СписокДокументов)
		|		И НЕ ra_Uvedomlenie.ПометкаУдаления
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ra_OtchetONesootvetstviiCHast2.Ссылка,
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА ПОДСТРОКА(ra_Uvedomlenie.Dogovor.ID_SRM, 1, 1) = ""8""
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ),
		|		ra_OtchetONesootvetstviiCHast2.Nesootvetstvie
		|	ИЗ
		|		Документ.ra_OtchetONesootvetstviiCHast2 КАК ra_OtchetONesootvetstviiCHast2
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ra_Uvedomlenie КАК ra_Uvedomlenie
		|			ПО ra_OtchetONesootvetstviiCHast2.Nesootvetstvie = ra_Uvedomlenie.Nesootvetstvie
		|	ГДЕ
		|		ra_OtchetONesootvetstviiCHast2.Ссылка В(&СписокДокументов)
		|		И НЕ ra_Uvedomlenie.ПометкаУдаления
		|		И НЕ ra_OtchetONesootvetstviiCHast2.ПометкаУдаления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ra_OtchetONesootvetstviiCHast2.Ссылка,
		|		ra_OtchetONesootvetstviiCHast2.Nesootvetstvie
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ra_ItogovyjOtchetONesootvetstvii.Ссылка,
		|		МАКСИМУМ(ВЫБОР
		|				КОГДА ПОДСТРОКА(ra_Uvedomlenie.Dogovor.ID_SRM, 1, 1) = ""8""
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ),
		|		ra_ItogovyjOtchetONesootvetstvii.Nesootvetstvie
		|	ИЗ
		|		Документ.ra_ItogovyjOtchetONesootvetstvii КАК ra_ItogovyjOtchetONesootvetstvii
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ra_Uvedomlenie КАК ra_Uvedomlenie
		|			ПО ra_ItogovyjOtchetONesootvetstvii.Nesootvetstvie = ra_Uvedomlenie.Nesootvetstvie
		|	ГДЕ
		|		ra_ItogovyjOtchetONesootvetstvii.Ссылка В(&СписокДокументов)
		|		И НЕ ra_Uvedomlenie.ПометкаУдаления
		|		И НЕ ra_ItogovyjOtchetONesootvetstvii.ПометкаУдаления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ra_ItogovyjOtchetONesootvetstvii.Ссылка,
		|		ra_ItogovyjOtchetONesootvetstvii.Nesootvetstvie) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции	

#КонецЕсли
